kiranjose/PIC18F14K50-USB-Joystick/USB/Device - HID - Joystick/Firmware/main.c
/******************************************************************************
 * Function:        void Joystick(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        This function will send the joystick data to the PC.  If
 *                  sw2 is pressed then it will simulate pressing a button,
 *                  moving the hat switch position, and moving two of the
 *                  analog stick postion variables.  Releasing sw2 will send
 *                  the info to the computer that indicates that nothing is
 *                  pressed on the joystick.
 *
 * Note:            None
 *****************************************************************************/
void Joystick(void)
{
    //If the last transmision is complete
    if(!HIDTxHandleBusy(lastTransmission))
    {
        //If the button is pressed

        if(!sw1 || !sw2  || !sw7  || !sw8 || !sw9 || !sw10 || !sw4 || !sw5 || !sw3 || !sw6)
        {
        //Indicate that the "x" button is pressed, but none others
	        if(!sw1)
	        {
	            joystick_input.members.buttons.square = 1;  //#1
	        }
	        else
	        {
				joystick_input.members.buttons.square = 0;
			} 

	        if(!sw2)
	        {
	            joystick_input.members.buttons.x = 1; //#2
	        }
	        else
	        {
				joystick_input.members.buttons.x = 0;
			}

	        if(!sw7) //switch is suspected short
	        {
	            joystick_input.members.buttons.o = 1; //#3 
	        }
	        else
	        {
				joystick_input.members.buttons.o = 0;
			}

	        if(!sw8) //switch is suspected short
	        {
	            joystick_input.members.buttons.triangle = 1; //#4
	        }
	        else
	        {
				joystick_input.members.buttons.triangle = 0;
			}

	        if(!sw9) //switch is suspected short
	        {
	            joystick_input.members.buttons.L1 = 1; //#5
	        }
	        else
	        {
				joystick_input.members.buttons.L1 = 0;
			} 
	        if(!sw10)
	        {
	            joystick_input.members.buttons.R1 = 1; //#6
	        }
	        else
	        {
				joystick_input.members.buttons.R1 = 0;
			}		
            
	        if(!sw4)
	        {
	            joystick_input.members.buttons.L2 = 1; //# 7 
            	joystick_input.members.hat_switch.hat_switch = HAT_SWITCH_NORTH;
	        }
	        else
	        {
				joystick_input.members.buttons.L2 = 0; 
			}
	        if(!sw5)  //short
	        {
	            joystick_input.members.buttons.R2 = 1; //#8  
				joystick_input.members.hat_switch.hat_switch = HAT_SWITCH_SOUTH;
	        }
	        else
	        {
				joystick_input.members.buttons.R2 = 0; 
			}
	        if(!sw3) //switch is suspected short
	        {
	            joystick_input.members.buttons.left_stick = 1; //#
				joystick_input.members.hat_switch.hat_switch = HAT_SWITCH_EAST;
	        }
	        else
	        {
				joystick_input.members.buttons.left_stick = 0;
			}
	        if(!sw6) //short
	        {
	            joystick_input.members.buttons.right_stick = 1;  //#
				joystick_input.members.hat_switch.hat_switch = HAT_SWITCH_WEST;
  
	        }
	        else
	        {
				 joystick_input.members.buttons.right_stick = 0;
			}
 

            joystick_input.members.buttons.select = 0; //#9
            joystick_input.members.buttons.start = 0; //#10
            
            
            joystick_input.members.buttons.home = 0;

            //Move the X and Y coordinates to the their extreme values (0x80 is
            //  in the middle - no value).
            //joystick_input.members.analog_stick.X = 0;
            //joystick_input.members.analog_stick.Y = 0;

           	//Send the packet over USB to the host.
           	lastTransmission = HIDTxPacket(HID_EP, (BYTE*)&joystick_input, sizeof(joystick_input));
    
        }
        else
        {
            //Reset values of the controller to default state

            //Buttons
            joystick_input.val[0] = 0x00;
            joystick_input.val[1] = 0x00;

            //Hat switch
            joystick_input.val[2] = 0x08;

            //Analog sticks
            joystick_input.val[3] = 0x80;
            joystick_input.val[4] = 0x80;
            joystick_input.val[5] = 0x80;
            joystick_input.val[6] = 0x80;

           	//Send the 8 byte packet over USB to the host.
           	lastTransmission = HIDTxPacket(HID_EP, (BYTE*)&joystick_input, sizeof(joystick_input));
        }
    }
    return;		
}//end joystick()




// ******************************************************************************************************
// ************** USB Callback Functions ****************************************************************
// ******************************************************************************************************
// The USB firmware stack will call the callback functions USBCBxxx() in response to certain USB related
// events.  For example, if the host PC is powering down, it will stop sending out Start of Frame (SOF)
// packets to your device.  In response to this, all USB devices are supposed to decrease their power
// consumption from the USB Vbus to <2.5mA each.  The USB module detects this condition (which according
// to the USB specifications is 3+ms of no bus activity/SOF packets) and then calls the USBCBSuspend()
// function.  You should modify these callback functions to take appropriate actions for each of these
// conditions.  For example, in the USBCBSuspend(), you may wish to add code that will decrease power
// consumption from Vbus to <2.5mA (such as by clock switching, turning off LEDs, putting the
// microcontroller to sleep, etc.).  Then, in the USBCBWakeFromSuspend() function, you may then wish to
// add code that undoes the power saving things done in the USBCBSuspend() function.

// The USBCBSendResume() function is special, in that the USB stack will not automatically call this
// function.  This function is meant to be called from the application firmware instead.  See the
// additional comments near the function.

